Revit 2024 API
FamilySizeTableManager.GetSizeTable Method
 Get a FamilySizeTable by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public FamilySizeTable GetSizeTable(
	string tableName
)
Visual Basic
Public Function GetSizeTable ( _
	tableName As String _
) As FamilySizeTable
Visual C++
public:
FamilySizeTable^ GetSizeTable(
	String^ tableName
)
Parameters
tableName
Type: System.String
 The FamilySizeTable name.
Return Value
 The FamilySizeTable of a given name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace